diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбоненскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

//ВКМ_НачалоДоработки_СмирноваСветлана_18.02.2024_Диплом
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ПрограммноеДобавлениеЭлементовНаФорму();
	
КонецПроцедуры //ВКМ_ОкончаниеДоработки	

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//ВКМ_НачалоДоработки_СмирноваСветлана_18.02.2024_Диплом
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ПрограммноеДобавлениеЭлементовНаФорму();
		
КонецПроцедуры //ВКМ_ОкончаниеДоработки

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//ВКМ_НачалоДоработки_СмирноваСветлана_18.02.2024_Диплом

&НаСервере
Процедура ПрограммноеДобавлениеЭлементовНаФорму()
	
	Если ЗначениеЗаполнено(Объект.ВидДоговора) Тогда
		
		ВКМ_СуммаАбоненскойПлаты = Элементы.Найти("ВКМ_СуммаАбоненскойПлаты");
		ВКМ_СтоимостьЧасаРаботы = Элементы.Найти("ВКМ_СтоимостьЧасаРаботы");
		
		Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
			
			Если ЕстьЭлементНаФорме(ВКМ_СуммаАбоненскойПлаты) Тогда
				ВКМ_СуммаАбоненскойПлаты.Видимость = Истина;
			Иначе
				ЭлементФормы = Элементы.Добавить("ВКМ_СуммаАбоненскойПлаты", Тип("ПолеФормы"));
				ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
				ЭлементФормы.Заголовок = "Сумма абоненской платы";
				ЭлементФормы.ПутьКДанным = "Объект.ВКМ_СуммаАбоненскойПлаты";
				ЭлементФормы.УстановитьДействие("ПриИзменении", "ВидДоговораПриИзменении");	
			КонецЕсли;
			
			Если ЕстьЭлементНаФорме(ВКМ_СтоимостьЧасаРаботы) Тогда
				ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
			КонецЕсли;
		
		Иначе		
		
			Если ЕстьЭлементНаФорме(ВКМ_СтоимостьЧасаРаботы) Тогда
				ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
			Иначе
				ЭлементФормы = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
				ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
				ЭлементФормы.Заголовок = "Стоимость часа работы";
				ЭлементФормы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
				ЭлементФормы.УстановитьДействие("ПриИзменении", "ВидДоговораПриИзменении");				
			КонецЕсли;
			
			Если ЕстьЭлементНаФорме(ВКМ_СуммаАбоненскойПлаты) Тогда
				ВКМ_СуммаАбоненскойПлаты.Видимость = Ложь;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьЭлементНаФорме(Элемент)
	
	Если Элемент = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

//ВКМ_ОкончаниеДоработки

#КонецОбласти
